### Week three practices

In [1]:
import pandas as pd

In [5]:
#  LOAD DATASE
df = pd.read_csv(r"sales_data.csv")

In [6]:
# first five rows 
df.head()

    Product  Units_Sold  Price_per_Unit Region
0       Pen         120              10  North
1  Notebook          80              40   West
2    Pencil         150               5  South
3    Eraser          60               8   East
4       Pen         100              10  North

In [7]:
# basic information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product         48 non-null     object
 1   Units_Sold      48 non-null     int64
 2   Price_per_Unit  48 non-null     int64
 3   Region          48 non-null     object
dtypes: int64(2), object(2)
memory usage: 1.6+ KB

In [8]:
# shape of row and col 
df.shape

(48, 4)

In [9]:
# checking the missing values
df.isnull().sum()

Product           0
Units_Sold        0
Price_per_Unit    0
Region            0
dtype: int64

In [10]:
# drop the missing value if exists 
df = df.dropna()

In [11]:
# basic statistics 
df.mean(numeric_only=True)

Units_Sold        100.937500
Price_per_Unit     16.458333
dtype: float64

In [12]:
df.max(numeric_only=True)

Units_Sold        175
Price_per_Unit     40
dtype: int64

In [13]:
df.min(numeric_only=True)

Units_Sold        40
Price_per_Unit     5
dtype: int64

In [14]:
df.describe(include=[float, int])

       Units_Sold  Price_per_Unit
count   48.000000       48.000000
mean   100.937500       16.458333
std     40.454548       13.118054
min     40.000000        5.000000
25%     67.750000        8.000000
50%     92.500000       10.000000
75%    138.500000       20.000000
max    175.000000       40.000000

### Project: Analyze a Simple Sales Dataset to find: total sales, best-selling product, and create a basic report

In [15]:
# Total Sales = Units Sold Ã— Price per Unit
df["Total_Sales"] = df["Units_Sold"] * df["Price_per_Unit"]

In [16]:
# final dataframe 
df.head()

    Product  Units_Sold  Price_per_Unit Region  Total_Sales
0       Pen         120              10  North         1200
1  Notebook          80              40   West         3200
2    Pencil         150               5  South          750
3    Eraser          60               8   East          480
4       Pen         100              10  North         1000

In [20]:
# total sales 
total_sales = df["Total_Sales"].sum()

In [21]:
total_sales

np.int64(70429)

In [17]:
# BEST SELLING PRODUCT (Based on Units Sold)

best_selling = df.groupby("Product")["Units_Sold"].sum().idxmax()

In [18]:
best_selling

'Pencil'

In [22]:
report = f"""
======================
   SALES REPORT
======================

Total Sales: {total_sales}

Best Selling Product: {best_selling}

Average Units Sold: {df["Units_Sold"].mean()}
Highest Units Sold: {df["Units_Sold"].max()}
Lowest Units Sold: {df["Units_Sold"].min()}

----------------------
Report Generated 
"""

In [24]:
print(report)

======================
   SALES REPORT
======================

Total Sales: 70429

Best Selling Product: Pencil

Average Units Sold: 100.9375
Highest Units Sold: 175
Lowest Units Sold: 40

----------------------
Report Generated

In [25]:
# Save report to file
with open("sales_report.txt", "w") as f:
    f.write(report)

In [27]:
print("Report saved as sales_report.txt")

Report saved as sales_report.txt